from managers import TestManager


class LoadTests:
    def __init__(self):
        test_data1 = [
            ("Яка столиця України?", [("Київ", True), ("Львів", False), ("Одеса", False)]),
            ("Скільки областей в Україні?", [("24", True), ("25", False), ("23", False)]),
            ("Яка найвища гора в Україні?", [("Говерла", True), ("Піп Іван", False), ("Петрос", False)]),
            ("Хто є автором гімну України?",
             [("Павло Чубинський", True), ("Тарас Шевченко", False), ("Іван Франко", False)]),
            ("В якому році була проголошена незалежність України?", [("1991", True), ("1992", False), ("1990", False)]),
            ("Яка найбільша річка в Україні?", [("Дніпро", True), ("Дунай", False), ("Південний Буг", False)]),
            ("Яке море омиває Україну?", [("Чорне", True), ("Азовське", False), ("Балтійське", False)])
        ]

        test_name = "Загальні знання про Україну"
        if not TestManager.test_exists(test_name):
            test1 = TestManager.create_test(test_name,
                                            "Тест на знання загальних фактів про Україну",
                                            test_data1)

        test_data2 = [
            ("Хто є автором 'Кобзаря'?", [("Тарас Шевченко", True), ("Іван Франко", False), ("Леся Українка", False)]),
            ("В якому році народився Тарас Шевченко?", [("1814", True), ("1815", False), ("1813", False)]),
            ("Де народився Тарас Шевченко?", [("Моринці", True), ("Київ", False), ("Харків", False)]),
            ("Як називається перше видання 'Кобзаря'?",
             [("Перший 'Кобзар'", True), ("'Кобзар' 1840", False), ("'Кобзар' Шевченка", False)]),
            ("В якому році помер Тарас Шевченко?", [("1861", True), ("1860", False), ("1862", False)]),
            ("Де похований Тарас Шевченко?",
             [("Чернеча гора", True), ("Байкове кладовище", False), ("Лук'янівське кладовище", False)]),
            ("Хто є автором поеми 'Гайдамаки'?",
             [("Тарас Шевченко", True), ("Іван Франко", False), ("Леся Українка", False)])
        ]

        test_name = "Тарас Шевченко"
        if not TestManager.test_exists(test_name):
            test2 = TestManager.create_test(test_name,
                                            "Тест на знання фактів з життя та творчості Тараса Шевченка",
                                            test_data2)

        test_data3 = [
            ("Хто є автором 'Захар Беркут'?",
             [("Іван Франко", True), ("Тарас Шевченко", False), ("Леся Українка", False)]),
            ("В якому році народився Іван Франко?", [("1856", True), ("1857", False), ("1855", False)]),
            ("Де народився Іван Франко?", [("Нагуєвичі", True), ("Львів", False), ("Івано-Франківськ", False)]),
            ("Як називається перше видання 'Захар Беркут'?",
             [("Перший 'Захар Беркут'", True), ("'Захар Беркут' 1883", False), ("'Захар Беркут' Франка", False)]),
            ("В якому році помер Іван Франко?", [("1916", True), ("1915", False), ("1917", False)]),
            ("Де похований Іван Франко?",
             [("Личаківське кладовище", True), ("Байкове кладовище", False), ("Сахарна гора", False)]),
            ("Хто є автором поеми 'Мойсей'?",
             [("Іван Франко", True), ("Тарас Шевченко", False), ("Леся Українка", False)])
        ]

        test_name = "Іван Франко"
        if not TestManager.test_exists(test_name):
            test3 = TestManager.create_test(test_name,
                                            "Тест на знання фактів з життя та творчості Івана Франка",
                                            test_data3)
